In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
import warnings
warnings.filterwarnings('ignore')

In [4]:
#load the dataset
df = pd.read_csv('Fraud_check (1).csv')
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [5]:
#print the frist five rows
df.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [6]:
#check the datatype
df.dtypes

Undergrad          object
Marital.Status     object
Taxable.Income      int64
City.Population     int64
Work.Experience     int64
Urban              object
dtype: object

In [7]:
#check the info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [8]:
#check the null value
df.isnull().sum()

Undergrad          0
Marital.Status     0
Taxable.Income     0
City.Population    0
Work.Experience    0
Urban              0
dtype: int64

In [9]:
#check the dimensional
df.shape

(600, 6)

In [11]:
#check the columns name
df.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [15]:
#seperate the Taxable.Income < = 30000 return as Risky else good
df_new_col = []
for i in df['Taxable.Income']:
    if(i <=30000):
        df_new_col.append('Risky')
    else:
        df_new_col.append('Good')
df_new_col1 = pd.DataFrame(df_new_col)

In [16]:
df_new_col1

        0
0    Good
1    Good
2    Good
3    Good
4    Good
..    ...
595  Good
596  Good
597  Good
598  Good
599  Good

[600 rows x 1 columns]

In [24]:
#drop the Taxable.Income in the dataframe
df_new = df.drop(df.columns[2],axis = 1)

In [26]:
#seperate the object and numer data type
df_new_object = df_new.select_dtypes('object')
df_new_integer = df_new.select_dtypes('int64')

In [28]:
#Data Transformation for object variable
from sklearn.preprocessing import LabelEncoder
for i in df_new_object:
    LE = LabelEncoder()
    df_new_object[i] = LE.fit_transform(df_new_object[i])

In [30]:
#combine the object and numerical datatype
df_new_value = pd.concat([df_new_integer,df_new_object],axis = 1)

In [31]:
df_new_value

     City.Population  Work.Experience  Undergrad  Marital.Status  Urban
0              50047               10          0               2      1
1             134075               18          1               0      1
2             160205               30          0               1      1
3             193264               15          1               2      1
4              27533               28          0               1      0
..               ...              ...        ...             ...    ...
595            39492                7          1               0      1
596            55369                2          1               0      1
597           154058                0          0               0      1
598           180083               17          1               1      0
599           158137               16          0               0      0

[600 rows x 5 columns]

In [33]:
#Data Transformation for df_new_value
from sklearn.preprocessing import StandardScaler
for i in df_new_value:
    SS = StandardScaler()
    df_new_value = SS.fit_transform(df_new_value)

In [36]:
df_new_value = pd.DataFrame(df_new_value)
df_new_value.columns = ['City.Population', 'Work.Experience', 'Undergrad',
       'Marital.Status', 'Urban']

In [37]:
df_new_value

     City.Population  Work.Experience  Undergrad  Marital.Status     Urban
0          -1.178521        -0.629143  -1.040833        1.160800  0.993355
1           0.508500         0.276370   0.960769       -1.274445  0.993355
2           1.033109         1.634639  -1.040833       -0.056822  0.993355
3           1.696831        -0.063197   0.960769        1.160800  0.993355
4          -1.630532         1.408261  -1.040833       -0.056822 -1.006689
..               ...              ...        ...             ...       ...
595        -1.390432        -0.968710   0.960769       -1.274445  0.993355
596        -1.071672        -1.534655   0.960769       -1.274445  0.993355
597         0.909696        -1.761033  -1.040833       -1.274445  0.993355
598         1.432197         0.163181   0.960769       -0.056822 -1.006689
599         0.991590         0.049992  -1.040833       -1.274445 -1.006689

[600 rows x 5 columns]

In [38]:
#Data Division
X = df_new_value
Y = df_new_col1

In [41]:
#Data Partition
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size = 0.3,random_state = 52)
print(X_train.shape,X_test.shape,Y_train.shape,Y_test.shape)

(420, 5) (180, 5) (420, 1) (180, 1)

In [46]:
#Data Modeling
from sklearn import tree
from sklearn.ensemble import RandomForestClassifier
RFC = RandomForestClassifier(n_estimators = 100 , criterion = 'entropy',max_samples = 0.5, max_features = 0.6,min_samples_split = 5)
RFC.fit(X_train,Y_train)

RandomForestClassifier(criterion='entropy', max_features=0.6, max_samples=0.5,
                       min_samples_split=5)

In [48]:
Y_pred_train = RFC.predict(X_train)
Y_pred_test = RFC.predict(X_test)

In [51]:
from sklearn.metrics import accuracy_score
print('Training Accuracy',accuracy_score(Y_pred_train,Y_train).round(2))
print('Testing Accuracy',accuracy_score(Y_pred_test,Y_test).round(2))

Training Accuracy 0.82
Testing Accuracy 0.83

In [67]:
#checking the hyper parameter optimization for checking the best parameter
from sklearn.model_selection import RandomizedSearchCV
n_estimators = [100,200,300,400,500,600]
criterion = ['entropy','gini']
max_samples = [0.5,0.6,0.7,0.8,0.9]
max_features = [0.5,0.6,0.7,0.8,0.9]
min_samples_split = [4,5,6,7,8]
value = {
    'n_estimators':n_estimators,
    'criterion':criterion,
    'max_samples':max_samples,
    'max_features':max_features,
    'min_samples_split':min_samples_split
}
RSCV = RandomizedSearchCV(RFC,cv  = 5,param_distributions = value,n_iter = 10,n_jobs = -1)
RSCV.fit(X_train,Y_train)
print(RSCV)

RandomizedSearchCV(cv=5,
                   estimator=RandomForestClassifier(max_features=0.6,
                                                    max_samples=0.5,
                                                    min_samples_split=7,
                                                    n_estimators=500),
                   n_jobs=-1,
                   param_distributions={'criterion': ['entropy', 'gini'],
                                        'max_features': [0.5, 0.6, 0.7, 0.8,
                                                         0.9],
                                        'max_samples': [0.5, 0.6, 0.7, 0.8,
                                                        0.9],
                                        'min_samples_split': [4, 5, 6, 7, 8],
                                        'n_estimators': [100, 200, 300, 400,
                                                         500, 600]})

In [68]:
#check the best parameter
RSCV.best_params_

{'n_estimators': 600,
 'min_samples_split': 7,
 'max_samples': 0.7,
 'max_features': 0.5,
 'criterion': 'entropy'}

In [75]:
RFC = RandomForestClassifier(n_estimators = 600 , criterion = 'entropy',max_samples = 0.7, max_features = 0.5,min_samples_split = 5)
RFC.fit(X_train,Y_train)
Y_pred_train = RFC.predict(X_train)
Y_pred_test = RFC.predict(X_test)

In [76]:
from sklearn.metrics import accuracy_score
print('Training Accuracy',accuracy_score(Y_pred_train,Y_train).round(2))
print('Testing Accuracy',accuracy_score(Y_pred_test,Y_test).round(2))

Training Accuracy 0.86
Testing Accuracy 0.83

In [77]:
#After Doing the Hyper parameter tuning  i got slightly increasing Accuracy

In [85]:
#cross validation doing the k-fold
from sklearn.model_selection import KFold,cross_val_score
K = KFold(n_splits = 15,shuffle  = False)
result = cross_val_score(RFC,X,Y,cv =10)
print(result)

[0.8        0.8        0.76666667 0.8        0.75       0.8
 0.78333333 0.76666667 0.75       0.78333333]

In [86]:
print(np.mean(result).round(2))

0.78

In [ ]:
#Finally I got random_forest is 78 % cross validation.